## Staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `aws_acm_certificate_validation.assets-notification-canada-ca[0]` |
|        | `aws_acm_certificate_validation.notification-canada-ca-alt[0]`    |
|        | `aws_acm_certificate_validation.notification-canada-ca[0]`        |
|        | `aws_route53_record.assets-notification-canada-ca[0]`             |
|        | `aws_route53_record.notification-canada-ca-alt[0]`                |
|        | `aws_route53_record.notification-canada-ca[0]`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate_validation.assets-notification-canada-ca[0] will be created
  + resource "aws_acm_certificate_validation" "assets-notification-canada-ca" {
      + certificate_arn         = "arn:aws:acm:us-east-1:239043911459:certificate/573a13c4-616a-4879-b027-f9c9569b2830"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.notification-canada-ca[0] will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/db0b2d43-d054-4c2f-b991-a946f665b445"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.notification-canada-ca-alt[0] will be created
  + resource "aws_acm_certificate_validation" "notification-canada-ca-alt" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:239043911459:certificate/317e3889-3b13-4c28-b360-7f5c7d54d2b8"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.assets-notification-canada-ca[0] will be created
  + resource "aws_route53_record" "assets-notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_0b5616f644860f7b52e4931e38065c17.assets.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_e9aaf2a3c80241e41690c26522275c0c.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca[0] will be created
  + resource "aws_route53_record" "notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_27cafbad13da9d68d8adaa666739eb99.api.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_3bc5d092ce090455c7a5a18436fa7d65.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification-canada-ca-alt[0] will be created
  + resource "aws_route53_record" "notification-canada-ca-alt" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_e74f939be5cfcfc2fc308bb85c925ed8.api.staging.notification.alpha.cdssandbox.xyz"
      + records         = [
          + "_6c5f1e054573eb4eeaef2eb212fafac8.gbycpywhzv.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.assets-notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
